# На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# Определите минимальное число монеток, которые нужно перевернуть, 
# чтобы все монетки были повернуты вверх одной и той же стороной. 
# Выведите минимальное количество монет, которые нужно перевернуть
from random import randint
import random
sum_coins = int (input('Введите количество монеток: '))
eagle = 0
tails = 0

for _ in range(sum_coins):
    coins = random.randint(0, 1)
    print (coins)
    if coins == 0:
        eagle += 1
    else:
        tails +=1
if eagle > tails:
    print ("Минимальное количестов монет с решкой")
else:
    print ("Минимальное количестов монет с орлом")
    
